'''
D1
作業2：請上 Kaggle, 在 Competitions 或 Dataset 中找一組競賽或資料並寫下：
  House Prices: Advanced Regression Techniques
1. 你選的這組資料為何重要
  資料內容詳細
2. 資料從何而來 (tips: 譬如提供者是誰、以什麼方式蒐集)
  The Ames Housing dataset by Dean De Cock
3. 蒐集而來的資料型態為何
  csv格式 欄位內的資料型態為數字及字串混和
4. 這組資料想解決的問題如何評估
  預測每個家庭的最終價格

作業3：想像你經營一個自由載客車隊，你希望能透過數據分析以提升業績，
  請你思考並描述你如何規劃整體的分析/解決方案：
1. 核心問題為何 (tips：如何定義 「提升業績 & 你的假設」)
  載客業務如果希望拓展藍海市場，則需要作出市場區隔
2. 資料從何而來 (tips：哪些資料可能會對你想問的問題產生影響 & 資料如何蒐集)
  可經由網路取得客戶使用體驗，建立關鍵字庫
  並結合觀光旅遊相關的政府機構，取得熱門景點的觀光數據
3. 蒐集而來的資料型態為何
  關鍵字庫的資料型態可能為大多為字串
  觀光數據的資料型態可能為大多為數字
4. 你要回答的問題，其如何評估 (tips：你的假設如何驗證)
  藉由關鍵字的建立可知道客戶心目中的關鍵因素
  並依照上述關鍵因素及光觀數據建立市場區隔的策略
  
D2
作業問題：思考題_請找出一個你認為機器學習可以發光發熱的領域並闡述原因?
醫學，可藉由機器學習找出特殊疾病的高發群以及針對各個病人的最適醫療方式
病歷資料可分析出容易發病的關鍵因素，然後依照個人病狀分析出最好的醫療組合模式

D3
請至以下機器學習巨頭的 blog 參觀，試著閱讀一篇文章並分析其 
Improving the Realism of Synthetic Images
作業 1：目標
提高合成圖像的真實感
作業 2：方法
神經網絡，監督訓練
作業 3：資料來源 
https://machinelearning.apple.com/

'''
